Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Naturally, if you want to declare templates at the top-level, directly in `/src/main/resources/templates/hello.txt`, for example, you can declare them in a toplevel (non-nested) `Templates` class:
ja_jp: 当然のことながら、トップレベルでテンプレートを宣言したい場合、例えば `/src/main/resources/templates/hello.txt` で直接宣言したい場合は、トップレベル(非入れ子)の `Templates` クラスで宣言することができます。

source: Naturally, the connector can also consume Cloud Events. The connector detects Cloud Events automatically by checking the record's headers. It also determines the mode.
ja_jp: 当然のことながら、コネクタはクラウドイベントを消費することもできます。コネクタは、レコードのヘッダをチェックすることで、自動的にクラウドイベントを検出します。また、モードも決定します。

source: Naturally, you can also group these parameters into a containing class:
ja_jp: 当然ながら、これらのパラメーターを含むクラスにまとめられます:

source: Naturally, you can also provide your own database identifier explicitly and implement the `PanacheEntity.Managed` interface in your entity, as well as use the `PanacheRepository.Managed` interface for your repository, in order to specify you database identifier type:
ja_jp: もちろん、独自のデータベース識別子を明示的に指定し、エンティティで `PanacheEntity.Managed` インターフェースを実装し、リポジトリには `PanacheRepository.Managed` インターフェースを使用して、データベース識別子型を指定することもできます。

source: Naturally, you can also use link:{jakarta-data-spec-url}[Jakarta Data] to define your repositories. For this you need to import the module:
ja_jp: 当然ながら、link:{jakarta-data-spec-url}[Jakarta Data] を使用してリポジトリを定義することもできます。そのためには、以下のモジュールをインポートする必要があります。

source: Nature
ja_jp: 種類

source: Navigate down to the `User authentication settings` section and press `Set up`:
ja_jp: `User authentication settings` セクションに移動し、 `Set up` を押します。

source: Navigate to link:http://localhost:8080/q/swagger-ui/[localhost:8080/q/swagger-ui/] and observe the Swagger UI screen:
ja_jp: link:http://localhost:8080/q/swagger-ui/[localhost:8080/q/swagger-ui/] を開いて、Swagger UI画面を確認します:

source: Navigate to link:http://localhost:8080/q/swagger-ui/[localhost:8080/q/swagger-ui/] and you will see the Swagger UI screen:
ja_jp: link:http://localhost:8080/q/swagger-ui/[localhost:8080/q/swagger-ui/] に移動すると、Swagger UIの画面が表示されます:

source: Navigating recent changes in Quarkus URI path resolution
ja_jp: QuarkusのURIパス解決における最近の変更点を探索

source: Navigation
ja_jp: ナビゲーション

source: Navigation between templates/code
ja_jp: テンプレート／コード間のナビゲーション

source: Near Caching
ja_jp: ニアキャッシング

source: Near caching is disabled by default, but you can enable it by setting the profile config property `quarkus.infinispan-client.near-cache-max-entries` to a value greater than 0. You can also configure a regular expression so that only a subset of caches have near caching applied through the `quarkus.infinispan-client.near-cache-name-pattern` attribute.
ja_jp: ニア・キャッシングは既定では無効になっていますが、プロファイル設定プロパティ `quarkus.infinispan-client.near-cache-max-entries` を 0 より大きい値に設定することで有効にできます。 また、正規表現を構成して、 `quarkus.infinispan-client.near-cache-name-pattern` 属性を通じたキャッシュの一部のみニア・キャッシングを適用できます。

source: Near caching is disabled by default, but you can enable it on a per cache basic by configuring the following properties:
ja_jp: ニアキャッシングはデフォルトでは無効ですが、次のプロパティを設定することで、キャッシュ単位で有効にすることができます:

source: Negative caching and nulls
ja_jp: ネガティブキャッシングとnull

source: Negative health check procedures
ja_jp: ネガティブヘルスチェックプロシージャ

source: Negotiation
ja_jp: ネゴシエーション

source: Neither a type variable nor a wildcard is a legal type parameter for an `@All List<>` injection point, i.e. `@Inject @All List<?> all` is not supported and results in a deployment error.
ja_jp: 型変数もワイルドカードも `@All List<>` インジェクションポイントのタイプパラメーターとしては有効ではありません。つまり、 `@Inject @All List<?> all` はサポートされておらず、デプロイメントエラーになります。

source: Neither of the operands may be `null`.
ja_jp: どちらのオペランドも `null` であってはなりません。

source: Neo4j Client
ja_jp: Neo4jクライアント

source: Neo4j client
ja_jp: Neo4j クライアント

source: Nested Config Mapping groups.
ja_jp: ネストされた設定マッピンググループ。

source: Nested Diagnostics context values
ja_jp: 入れ子診断のコンテキスト値

source: Nested Tests
ja_jp: ネストしたテスト

source: Nested Type-safe Templates
ja_jp: ネストされたタイプセーフなテンプレート

source: Nested Virtual Method Example
ja_jp: 入れ子になった仮想メソッドの例

source: Nested blocks are used to specify the parts that should be overridden.
ja_jp: 入れ子になったブロックは、オーバーライドするパーツを指定するために使用されます。

source: Nested builders also use static factory methods
ja_jp: ネストされたビルダーも静的ファクトリーメソッドを使用します

source: Nested elements need to be spied individually by Mockito.
ja_jp: ネストされた要素は、Mockitoが個別にスパイする必要があります。

source: Nested groups
ja_jp: ネストされたグループ

source: Nested test
ja_jp: ネストされたテスト

source: Netflix Technology Blog:
ja_jp: Netflix Technology ブログ:

source: Netty and marker annotations
ja_jp: Netty とマーカーアノテーション

source: Netty caches small buffers within a given thread to avoid frequent memory allocations and improve performance. If the same thread needs memory, it will first check in its own cache. This is particularly efficient due to the event loop threading model (low number of threads). Note that the tiny caches are now merged into the small ones.
ja_jp: Nettyは、頻繁なメモリ割り当てを回避し、パフォーマンスを向上させるために、特定のThread内に小さなバッファーをキャッシュします。同じスレッドがメモリを必要とする場合、まず自身のキャッシュをチェックします。これは、イベントループスレッドモデル (スレッド数が少ない) のおかげで特に効率的です。なお、現在、tinyキャッシュはsmallキャッシュにマージされています。

source: Netty is a non-blocking I/O client-server framework. Used by Quarkus as foundation layer.
ja_jp: Netty は、ノンブロッキング I/O クライアントサーバーフレームワークです。Quarkus の基盤レイヤーとして使用されます。

source: Netty memory management metrics
ja_jp: Netty メモリ管理メトリクス

source: Netty trying to determine if a `ChannelHandler` is sharable
ja_jp: `ChannelHandler` が共有可能かどうかを判断しようとする Netty

source: Netty trying to determine whether virtual threads are available
ja_jp: 仮想スレッドが利用可能か判断しようとする Netty

source: Netty uses **PooledByteBufAllocator** to reduce memory allocation overhead and fragmentation. It is based on a **jemalloc-style arena system** (see https://github.com/jemalloc/jemalloc[jemalloc/jemalloc]), which includes:
ja_jp: Nettyは、メモリ割り当てのオーバーヘッドとフラグメンテーションを削減するために **PooledByteBufAllocator** を使用します。これは、**jemallocスタイルのアリーナシステム** (参照: https://github.com/jemalloc/jemalloc[jemalloc/jemalloc]) に基づいており、以下を含みます。

source: Netty uses two primary memory categories:
ja_jp: Nettyは主に2つのメモリカテゴリーを使用します。

source: Network Protocols and Utilities
ja_jp: ネットワークプロトコルとユーティリティ

source: Network read/write bytes.
ja_jp: ネットワークの読み書きバイト数。

source: Network read/write duration.
ja_jp: ネットワークの読み取り/書き込みの期間。

source: Never construct your own absolute paths. Adding a suffix to a known, normalized and resolved path is fine.
ja_jp: 自分で絶対パスを構築してはいけません。正規化された既知のパスにサフィックスを追加することは問題ありません。

source: New
ja_jp: 新

source: New Amazon IAM extension
ja_jp: 新しいAmazon IAMのエクステンション

source: New Credentials Provider extension
ja_jp: 新しいクレデンシャルプロバイダーエクステンション

source: New Dev UI
ja_jp: 新しいDev UI

source: New Extension for Amazon IAM
ja_jp: Amazon IAM の新しいエクステンション

source: New Features
ja_jp: 新機能

source: New OpenTelemetry property
ja_jp: 新しい OpenTelemetry プロパティー

source: New Qute Features
ja_jp: Quteの新機能

source: New Qute error pages
ja_jp: 新しい Qute のエラーページ

source: New REST layer by default
ja_jp: 新しいRESTレイヤーのデフォルト化

source: New Redis Client API
ja_jp: 新しいRedisクライアントAPI

source: New Sampler config value
ja_jp: 新サンプラーの設定値

source: New Sampler config value (Parent based)
ja_jp: 新サンプラーの設定値（親ベース）

source: New `*Param` annotations
ja_jp: 新しい `*Param` アノテーション

source: New codelens for Vert.x reactive routes
ja_jp: Vert.xリアクティブルート用の新しいコードレンズ

source: New guide for Deploying to Google Cloud
ja_jp: Google Cloudにデプロイするための新しいガイド

source: New guides
ja_jp: 新しいガイド

source: New month, new Quarkus feature release, you know the drill: Quarkus 2.10.0.Final has landed.
ja_jp: 新しい月、新しいQuarkusの機能リリース、ご存知でしょう。Quarkus 2.10.0.Finalがリリースされました。

source: New optimal message body reader / writer
ja_jp: 新しい最適なメッセージボディのリーダー/ライター

source: New quarkus Maven packaging and lifecycle
ja_jp: 新しいQuarkus Mavenパッケージングとライフサイクル

source: New request cancellation support to avoid unnecessary processing.
ja_jp: 不必要な処理を避けるための新しいリクエスト・キャンセル・サポート。

source: New request/response filter design
ja_jp: リクエスト/レスポンスフィルターの新しい設計

source: New syntax coloration
ja_jp: 新しい構文のカラーリング

source: New template fragment support
ja_jp: 新しいテンプレート・フラグメントのサポート

source: New world, new rules!
ja_jp: 新しい世界、新しいルール!

source: Newline
ja_jp: 改行

source: Newsletter
ja_jp: ニュースレター

source: Next Monday (8th Feb 21), we will do Quarkus Insights based on your questions.
ja_jp: 来週月曜日（21年2月8日）には、皆様からの質問をもとに、Quarkus Insightsを行います。

source: Next Monday (Jan 17.), we will do Quarkus Insights based on your questions.
ja_jp: 来週月曜日(1月17日)は、皆さんの質問をもとに、Quarkus Insightsを行います。

source: Next Monday (July 25.), we will do Quarkus Insights based on your questions.
ja_jp: 来週月曜日(7月25日)、皆さんの質問をもとにQuarkus Insightsを行います。

source: Next Steps
ja_jp: 次のステップ

source: Next Wednesday (Jun 2.), we will do Quarkus Insights based on your questions.
ja_jp: 来週水曜日(6/2)は、皆様からの質問を元にQuarkus Insightsを行います。

source: Next a few times (review the different options if needed)
ja_jp: Next を数回(必要に応じてオプションを確認)

source: Next adjust */webapp/src/App.js* to call our Quarkus service endpoint and render our particle component with the response data:
ja_jp: 次に、 */webapp/src/App.js* を調整して、Quarkusサービスのエンドポイントを呼び出し、レスポンスデータを使ってパーティクルコンポーネントをレンダリングします。

source: Next create a Docker Compose file (`docker-compose.yaml`) for spinning up the two applications as well as Apache Kafka and ZooKeeper like so:
ja_jp: 次に、2 つのアプリケーションを起動するための Docker Compose ファイル ( `docker-compose.yaml` ) を作成し、Apache Kafka と ZooKeeper と同様に以下のようにします。

source: Next create a Docker Compose file (`docker-compose.yaml`) for spinning up the two applications as well as Apache Kafka like so:
ja_jp: 次に、2つのアプリケーションとApache Kafkaを起動するためのDocker Compose ファイル ( `docker-compose.yaml` ) を次のように作成します。

source: Next create a new Spring bean in `src/main/java/org/acme/spring/di/MessageProducer.java` with the following content:
ja_jp: 次に、 `src/main/java/org/acme/spring/di/MessageProducer.java` に以下の内容で新しいSpring Beanを作成します:

source: Next invoke the bcc/eBPF script giving it the PID of the Quarkus process, so that it can track the `malloc` calls, capture stack traces and dump them to a file for post-processing:
ja_jp: 次に、Quarkus プロセスの PID を指定して bcc/eBPF スクリプトを呼び出します。 `malloc` 呼び出しを追跡できるようにするため、 スタックトレースをキャプチャーし、後処理のためにファイルにダンプします。

source: Next let's add a REST Client with `OidcClientRequestReactiveFilter` and another REST Client with `AccessTokenRequestReactiveFilter`. `FrontendResource` will use these two clients to call `ProtectedResource`:
ja_jp: 次に、 `OidcClientRequestReactiveFilter` のRESTクライアントと、 `AccessTokenRequestReactiveFilter` のRESTクライアントを追加しましょう。 `FrontendResource` は、この2つのクライアントを使用して、 `ProtectedResource` を呼び出します：

source: Next let's add a REST Client with `OpenID Connect Client Reactive Filter` and another REST Client with `OpenID Connect Token Propagation Filter`. `FrontendResource` will use these two clients to call `ProtectedResource`:
ja_jp: 次に、 `OpenID Connect Client Reactive Filter` を持つ REST Client と、 `OpenID Connect Token Propagation Filter` を持つ REST Client を追加します。 `FrontendResource` はこの 2 つのクライアントを使用して、 `ProtectedResource` を呼び出します:

source: Next obtain an access token for `admin`:
ja_jp: 次に `admin` 用のアクセストークンを取得します。

source: Next one?
ja_jp: 次は？

source: Next prepare your `application.properties`. You can start with a completely empty `application.properties` as `Dev Services for Keycloak` will register `quarkus.oidc.auth-server-url` pointing to the running test container as well as `quarkus.oidc.client-id=quarkus-app` and `quarkus.oidc.credentials.secret=secret`.
ja_jp: 次に、 `application.properties` を準備します。完全に空の `application.properties` から始めることができます。これは、 `Dev Services for Keycloak` が実行中のテストコンテナーをポイントする `quarkus.oidc.auth-server-url` ならびに `quarkus.oidc.client-id=quarkus-app` および `quarkus.oidc.credentials.secret=secret` を登録するためです。

source: Next run the following binary directly:
ja_jp: 次に、以下のバイナリーを直接実行します。

source: Next steps
ja_jp: 次のステップ

source: Next test the service by entering a relative service path and sending a token. SPA usually sends access tokens to the application endpoint, so choose `Test with Access Token` option, for example:
ja_jp: 次に、相対サービスパスを入力し、トークンを送信してサービスをテストします。SPAは通常、アプリケーションのエンドポイントにアクセストークンを送信するので、例えば、 `Test with Access Token` のオプションを選択します：

source: Next test the service with either the current access or ID token. SPA usually sends the access tokens to the application endpoints but there could be cases where the ID tokens are forwarded to the application frontends for them to be aware about the user who is currently logged into SPA.
ja_jp: 次に、現在のアクセスまたは ID トークンを使用してサービスをテストします。SPA は通常、アクセストークンをアプリケーションエンドポイントに送信しますが、ID トークンがアプリケーションフロントエンドに転送され、現在 SPA にログインしているユーザーを認識できる場合があります。

source: Next thing we need to do is ssh into our Kubernetes cluster so that we can send a curl request to our broker. Following command will create a simple OS pod so we can curl into our functions.
ja_jp: 次にすべきことは、Kubernetesクラスタにsshでログインして、ブローカにcurlリクエストを送信できるようにすることです。 以下のコマンドでシンプルなOSポッドを作成し、関数にcurlできるようにします。

source: Next thing we need to do is ssh into our Kubernetes cluster so that we can send a curl request to our broker. The following command will create a simple OS pod so we can curl into our functions.
ja_jp: 次にやるべきことは、Kubernetesクラスタにsshして、ブローカーにcurlリクエストを送ることです。以下のコマンドでシンプルなOSポッドを作成し、関数にcurlできるようにします。

source: Next update your extension to use `io.quarkus.oidc.client.spi.TokenProvider` CDI bean as required, for example:
ja_jp: 次に、必要に応じて `io.quarkus.oidc.client.spi.TokenProvider` CDI Bean を使用するようにエクステンションを更新します。次に例を示します。

source: Next we configure the `rabbitmq` credentials provider. The `credentials-role` option must be set to the name of the role we created in Vault, in our case `my-role`. The `credentials-mount` option must be set to `rabbitmq`.
ja_jp: 次に、 `rabbitmq` クレデンシャルプロバイダーを設定します。 `credentials-role` オプションは、Vault で作成したロールの名前 (この場合は `my-role`) に設定する必要があります。 `credentials-mount` オプションは `rabbitmq` に設定する必要があります。

source: Next you must copy some files from your GraalVM distribution into `src/main/zip.native/`.
ja_jp: 次に、GraalVM ディストリビューションから `src/main/zip.native/` にいくつかのファイルをコピーする必要があります。

source: Next you need to create the keyspace and table that will be used by your application. If you are using Docker, run the following commands:
ja_jp: 次に、アプリケーションで使用するキースペースとテーブルを作成する必要があります。Dockerを使用している場合は、以下のコマンドを実行します。

source: Next, a docker image is required by Knative, so you'll need to build that next:
ja_jp: 次に、Knativeではdockerイメージが必要なので、続いてそれをビルドする必要があります。

source: Next, a public JAX-RS resource that generates session-expired pages can use this cookie to create a page tailored for this user and the corresponding OIDC tenant, for example:
ja_jp: 次に、セッション期限切れページを生成するパブリック JAX-RS リソースは、この Cookie を使用して、このユーザーと対応する OIDC テナントに合わせたページを作成できます。次に例を示します。

source: Next, a public JAX-RS resource which generates session expired pages can use this cookie to create a page tailored for this user and the corresponding OIDC tenant, for example:
ja_jp: 次に、この Cookie を、セッション期限切れページを生成するパブリック JAX-RS リソースで使用して、このユーザーと対応する OIDC テナントに合わせたページを作成できます。次に例を示します。

source: Next, add a REST client interface representing `ApiEchoService`:
ja_jp: 次に、 `ApiEchoService` を表す REST クライアントインターフェイスを追加します。

source: Next, add a SAML provider to Keycloak:
ja_jp: 次に、SAMLプロバイダーをKeycloakに追加します：

source: Next, add the following REST clients:
ja_jp: 次に、以下の REST クライアントを追加します。

source: Next, after selecting *Log into Single Page Application*, you are redirected to Keycloak to authenticate, for example, as `alice:alice`. Then, you are returned to the page representing the SPA:
ja_jp: 次に、*Log into Single Page Application* を選択すると、Keycloak にリダイレクトされ、たとえば `alice:alice` として認証されます。 次に、SPA を表すページに戻ります。

source: Next, after selecting `Log into Single Page Application`, you will be redirected to Keycloak to authenticate, example, as `alice:alice` and then returned to the page representing the SPA:
ja_jp: 次に、 `Log into Single Page Application` を選択すると、Keycloakにリダイレクトされ、例えば、 `alice:alice` として認証され、SPAを表すページに戻ります：

source: Next, after you select this option, you will be redirected to Keycloak to authenticate, example, as `alice:alice` and then returned to the page representing the SPA:
ja_jp: 次に、このオプションを選択すると Keycloak にリダイレクトされ、たとえば `alice:alice` として認証され、SPA 表示ページに戻ります。

source: Next, are examples of the metrics collected by Micrometer and a comparison of what would be the `quarkus-micrometer-registry-prometheus` output vs the one on this bridge. A link to the equivalent OpenTelemetry Semantic Convention is also provided for reference and is not currently used in the bridge.
ja_jp: 次に、Micrometer によって収集されたメトリクスの例と、`quarkus-micrometer-registry-prometheus` の出力とこのブリッジの出力の比較を示します。同等の OpenTelemetry セマンティックコンベンションへのリンクも参照用に提供されていますが、これは現在ブリッジでは使用されていません。

source: Next, are examples of the metrics collected by Micrometer compared with what would be the `quarkus-micrometer-registry-prometheus` endpoint output (`/q/metrics`) vs the OTLP protocol output on this bridge.
ja_jp: 次に、 Micrometer によって収集されたメトリクスの例として、 `quarkus-micrometer-registry-prometheus` エンドポイントの出力 (`/q/metrics`) と、 このブリッジでの OTLP プロトコル出力の比較を示します。

source: Next, check the `FrontendResource` methods, which do not propagate the existing tokens but use `OidcClient` to get and propagate the tokens. As already shown, `OidcClient` is configured to get the tokens for the `alice` user.
ja_jp: 次に、既存のトークンを伝播せず、 `OidcClient` を使用してトークンを取得および伝播する `FrontendResource` メソッドを確認します。 すでに示したように、 `OidcClient` は `alice` ユーザーのトークンを取得するように設定されています。

source: Next, configure it to point to a Keycloak SAML broker endpoint. At this point, you need to know the name of the Keycloak realm, for example, `quarkus`, and, assuming that the Keycloak SAML broker alias is `saml`, enter the endpoint address as `http://localhost:8081/realms/quarkus/broker/saml/endpoint`. Enter the service provider (SP) entity ID as `http://localhost:8081/realms/quarkus`, where `http://localhost:8081` is a Keycloak base address and `saml` is a broker alias:
ja_jp: 次に、Keycloak SAML ブローカーエンドポイントを指すように設定します。 この時点で、Keycloak レルムの名前 (例: `quarkus`) を知っておく必要があります。Keycloak SAML ブローカーのエイリアスが `saml` であると仮定して、エンドポイントアドレスを `http://localhost:8081/realms/quarkus/broker/saml/endpoint` と入力します。 サービスプロバイダー (SP) エンティティー ID を `http://localhost:8081/realms/quarkus` と入力します。ここで、 `http://localhost:8081` は Keycloak ベースアドレスで、 `saml` はブローカーエイリアスです。

source: Next, configure it to point to a Keycloak SAML broker endpoint. At this point, you need to know the name of the Keycloak realm, for example, `quarkus`, and, assuming that the Keycloak SAML broker alias is `saml`, enter the endpoint address as `http:localhost:8081/realms/quarkus/broker/saml/endpoint`. Enter the service provider (SP) entity ID as `http:localhost:8081/realms/quarkus`, where `http://localhost:8081` is a Keycloak base address and `saml` is a broker alias:
ja_jp: 次に、Keycloak SAML ブローカーエンドポイントを指すように設定します。 この時点で、Keycloak レルムの名前 (例: `quarkus`) を知っておく必要があります。Keycloak SAML ブローカーのエイリアスが `saml` であると仮定して、エンドポイントアドレスを `http:localhost:8081/realms/quarkus/broker/saml/endpoint` と入力します。 サービスプロバイダー (SP) エンティティー ID を `http:localhost:8081/realms/quarkus` と入力します。ここで、 `http://localhost:8081` は Keycloak ベースアドレスで、 `saml` はブローカーエイリアスです。

source: Next, configure the plugin as follows:
ja_jp: 次に、以下のようにプラグインを設定します:

source: Next, configure the required realms:
ja_jp: 次に、必要なレルムを設定します:

source: Next, copy the import cypher script and CSV files into Neo4j's import folder:
ja_jp: 次に、インポートサイファースクリプトとCSVファイルをNeo4jのインポートフォルダにコピーします。

source: Next, define the `/api/admin` endpoint. The following code represents a simple Jakarta REST resource protected with authentication:
ja_jp: 次に、 `/api/admin` エンドポイントを定義します。 次のコードは、認証で保護された単純な Jakarta REST リソースを表しています。

source: Next, ensure that the `generate-code` phase is enabled in the Quarkus Maven plugin:
ja_jp: 次に、Quarkus Maven プラグインで `generate-code` フェーズが有効化されていることを確認します。

source: Next, generate a flame graph using the data captured via `perf record`:
ja_jp: 次に、 `perf record` を介してキャプチャされたデータを使用してフレームグラフを生成します。

source: Next, go to the http://localhost:8080/q/dev/, login to Auth0 from the Dev UI SPA and notice you can now logout from the OIDC Dev UI too, see the symbol representing the logout next to the `Logged in as Sergey Beryozkin` text:
ja_jp: 次に、 http://localhost:8080/q/dev/ に移動し、Dev UI SPA から Auth0 にログインします。 `Logged in as Sergey Beryozkin` というテキストの横に、ログアウトを表す記号が表示され、OIDC Dev UI からもログアウトが可能になったことがわかります。

source: Next, if you need to access both mTLS and OIDC bearer security identities, consider enabling xref:security-authentication-mechanisms.adoc#combining-authentication-mechanisms[Inclusive authentication] with `quarkus.http.auth.inclusive=true`.
ja_jp: 次に、mTLS と OIDC ベアラーセキュリティーアイデンティティーの両方にアクセスする必要がある場合は、 `quarkus.http.auth.inclusive=true` を使用して xref:security-authentication-mechanisms.adoc#combining-authentication-mechanisms[統合認証] を有効にすることを検討してください。

source: Next, if you want, you can register this Keycloak SAML provider as a default provider by navigating to `Authentication/browser/Identity Provider Redirector config` and setting both the `Alias` and `Default Identity Provider` properties to `saml`. If you do not configure it as a default provider then, at authentication time, Keycloak offers 2 options:
ja_jp: 次に、必要に応じて、 `Authentication/browser/Identity Provider Redirector config` に移動し、 `Alias` プロパティーと `Default Identity Provider` プロパティーの両方を `saml` に設定して、この Keycloak SAML プロバイダーをデフォルトプロバイダーとして登録できます。 デフォルトのプロバイダーとして設定しない場合は、認証時に Keycloak は次の 2 つのオプションを提供します。

source: Next, let's add a `csrfToken.html` Qute template producing an HTML form in the `src/main/resources/templates` folder:
ja_jp: 次に、このテンプレートを含むファイルを `csrfToken.html` と名付け、 `src/main/resources/templates` フォルダに置いてください:

source: Next, let's create the actual streaming query implementation itself in the `aggregator/src/main/java/org/acme/kafka/streams/aggregator/streams/TopologyProducer.java` file. All we need to do for that is to declare a CDI producer method which returns the Kafka Streams `Topology`; the Quarkus extension will take care of configuring, starting and stopping the actual Kafka Streams engine.
ja_jp: 次に、実際のストリーミングクエリの実装自体を `aggregator/src/main/java/org/acme/kafka/streams/aggregator/streams/TopologyProducer.java` ファイルで作成してみましょう。そのために必要なのは、Kafka Streams `Topology` を返す CDI プロデューサメソッドを宣言することだけです。

source: Next, let's expand the query further and try to find all links with a depth of 2 to the `persist` method:
ja_jp: 次に、クエリをさらに拡張して、 `persist` メソッドへの深さが2のリンクをすべて探してみましょう。

source: Next, let's extend our `VertxResource` class with the following code:
ja_jp: 次に、 `VertxResource` クラスを以下のコードで拡張してみましょう：

source: Next, let's try out some cypher queries to explore the call graph. I don't know anything about the Quarkus application itself, but given it's a Hibernate ORM application, I can assume that some sort of `persist` method will be called. Go into the browser and type a query for this:
ja_jp: 次に、コールグラフを調べるために、いくつかのサイファークエリを試してみましょう。Quarkusアプリケーション自体については何も知りませんが、Hibernate ORMアプリケーションであることから、ある種の `persist` メソッドが呼び出されることが想定されます。ブラウザにアクセスして、このクエリを入力してください。

source: Next, native executables on Linux and macOS platforms typically do not have a file extension but Windows executables do, we need to take care of this when renaming the generated executable. We can also place the generated distributions into their own directory to avoid cluttering the `target` directory. Thus, let's add a couple of properties to the existing `<properties>` section in the `pom.xml`:
ja_jp: 次に，Linux や macOS プラットフォーム上のネイティブ実行可能ファイルには通常拡張子がありませんが，Windows の実行ファイルには拡張子がありますので，生成された実行ファイルの名前を変更する際にはこの点に注意する必要があります．また，生成されたディストリビューションを独自のディレクトリに配置することで， `target` ディレクトリが散らかるのを防ぐことができます．そこで、 `pom.xml` の既存の `<properties>` セクションに、いくつかのプロパティを追加してみましょう。

source: Next, obtain an access token for `admin`:
ja_jp: 次に `admin` 用のアクセストークンを取得します。
